# ##########################################################################################
# 專案名稱: 多重目標自動辨識系統 - 子組態映射聚合入口 (Sub-Config Mapping Aggregation Entry)
# 維護日期: 2026-09-11
# 檔案路徑: MARS_Project/config/maps/__init__.py
# ##########################################################################################

# 掛載內部依賴
from . import schm_maps
from . import stage_maps

# =============================================
# ⭐｜模組導出｜對外公開接口匯出
# =============================================
# 1. schm_maps  : [套件] 資料表屬性定義集 >>> 集中存放訓練與辨識層級之資料表實體屬性定義。
# 2. stage_maps : [套件] 階層式管線策略配置集 >>> 集中存放多領域模型訓練與即時辨識之階層策略定義。

__all__ = ["schm_maps", "stage_maps"]