# ##########################################################################################
# 專案名稱: 多重目標自動辨識系統 - 資料表屬性定義集入口 (Table Attributes Definition Set Entry)
# 維護日期: 2026-09-11
# 檔案路徑: MARS_Project/config/maps/schm_maps/__init__.py
# ##########################################################################################

# 掛載內部依賴
from .train_schm import TRAIN_SCHEMA_INFO
from .infer_schm import INFER_SCHEMA_INFO

# =============================================
# ⭐｜模組導出｜對外公開接口匯出
# =============================================
# 1. TRAIN_SCHEMA_INFO : [定義] 訓練層級之資料表屬性字典 >>> 提供訓練流程資料表之實體名稱與核心欄位結構。
# 2. INFER_SCHEMA_INFO : [定義] 辨識層級之資料表屬性字典 >>> 提供辨識流程資料表之實體名稱與核心欄位結構。

__all__ = ["TRAIN_SCHEMA_INFO", "INFER_SCHEMA_INFO"]